# Notebook about Pandas

In [26]:
lista = [1,2,3,4,5,6]

In [27]:
lista2 = ["Save","The","Pandas"]

In [28]:
lista[0]

1

In [29]:
lista[1:3]

[2, 3]

Elements closed by left and open by right

In [30]:
lista[2:]

[3, 4, 5, 6]

In [31]:
lista[:2]

[1, 2]

In [32]:
for element in lista:
    print element

1
2
3
4
5
6

In [33]:
for element in lista2:
    print element

Save
The
Pandas

In [34]:
len(lista2)

3

In [35]:
range(0,len(lista2))

[0, 1, 2]

In [36]:
for position in range(0,len(lista)):
    print lista[position]

1
2
3
4
5
6

In [37]:
for element in enumerate(lista2):
    print element

(0, 'Save')
(1, 'The')
(2, 'Pandas')

In [38]:
for i,element in enumerate(lista2):
    print i
    print element

0
Save
1
The
2
Pandas

In [39]:
[number for number in lista]

[1, 2, 3, 4, 5, 6]

In [40]:
lista3=[2*number+1 for number in lista]

In [41]:
lista

[1, 2, 3, 4, 5, 6]

In [74]:
lista3

[3, 5, 7, 9, 11, 13]

They are not variables, in fact they are views

In [53]:
lista4=lista
lista4[2]=0
lista

[1, 2, 0, 4, 5, 6]

### Dictionary

In [42]:
dic={"hello":1,3:"guays"}

In [43]:
dic[3]

'guays'

In [44]:
dic["hello"]

1

In [45]:
for element in dic:
    print element

3
hello

In [46]:
for element in dic:
    print dic[element]

guays
1

### Numpy

In [47]:
import numpy as np

In [48]:
array1=np.array([1,2,3,4])

In [49]:
array1

array([1, 2, 3, 4])

In [60]:
array2=array1
array2[3]=0;
array1

array([1, 2, 3, 0])

In [56]:
%time print "hello"

hello
CPU times: user 26 µs, sys: 9 µs, total: 35 µs
Wall time: 40.1 µs

In [55]:
listamillon=range(0,100000)
%time newlist = [number+1 for number in listamillon]

CPU times: user 12.5 ms, sys: 3.39 ms, total: 15.9 ms
Wall time: 15.7 ms

In [59]:
#Easier and faster with arrays
arraymillon=np.arange(10000)
%time newarray = arraymillon+1

CPU times: user 40 µs, sys: 13 µs, total: 53 µs
Wall time: 61 µs

### Pandas Series

In [61]:
import pandas as pd
from pandas import Series

In [65]:
serie1=Series(lista2)
serie1

0      Save
1       The
2    Pandas
dtype: object

In [67]:
serie2=Series(lista2,index=[5,6,7])
serie2

5      Save
6       The
7    Pandas
dtype: object

In [68]:
serie2.index

Int64Index([5, 6, 7], dtype='int64')

In [69]:
serie2.index.values

array([5, 6, 7])

In [70]:
serie2.values

array(['Save', 'The', 'Pandas'], dtype=object)

In [71]:
serie3=Series(lista2,index=["element1","element2","element3"])
serie3

element1      Save
element2       The
element3    Pandas
dtype: object

In [73]:
lista3
serie4=Series(lista3)
serie4

0     3
1     5
2     7
3     9
4    11
5    13
dtype: int64

In [75]:
serie4+serie4

0     6
1    10
2    14
3    18
4    22
5    26
dtype: int64

In [86]:
# Operations with unmatched indexes
serie5 = Series(lista3,index=[1,2,3,4,5,6])
serie5

1     3
2     5
3     7
4     9
5    11
6    13
dtype: int64

In [85]:
serie4+serie5

0   NaN
1     8
2    12
3    16
4    20
5    24
6   NaN
dtype: float64

In [84]:
# Independent of order of index
Series(lista3,index=[1,2,3,5,4,6])

1     3
2     5
3     7
5     9
4    11
6    13
dtype: int64

In [88]:
# Independet of Duplicated indexes
serie6=Series(lista3,index=[1,2,2,3,4,5])
serie6

1     3
2     5
2     7
3     9
4    11
5    13
dtype: int64

In [158]:
serie6[2]

14

### Panda Dataframe

In [94]:
from pandas import DataFrame

In [89]:
serie6=serie4*2

In [96]:
dataframe1=DataFrame([serie4,serie6])
dataframe1

   0   1   2   3   4   5
0  3   5   7   9  11  13
1  6  10  14  18  22  26

In [103]:
dataframe1=DataFrame({"col1":serie4,"col2":serie6})
dataframe1

   col1  col2
0     3     6
1     5    10
2     7    14
3     9    18
4    11    22
5    13    26

In [109]:
dataframe1.index

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [110]:
dataframe1['col1']

0     3
1     5
2     7
3     9
4    11
5    13
Name: col1, dtype: int64

In [128]:
dataframe2=DataFrame({"col1":[1,2,3],"col2":["Save","The","Pandas"]})

In [129]:
dataframe2

   col1    col2
0     1    Save
1     2     The
2     3  Pandas

In [130]:
dataframe2["col2"]

0      Save
1       The
2    Pandas
Name: col2, dtype: object

In [131]:
dataframe1["col3"]=1
dataframe1

   col1  col2  col3  col4
0     3     6     1     0
1     5    10     1     1
2     7    14     1     2
3     9    18     1     3
4    11    22     1     4
5    13    26     1     5

In [132]:
dataframe1["col4"]=np.arange(6)
dataframe1

   col1  col2  col3  col4
0     3     6     1     0
1     5    10     1     1
2     7    14     1     2
3     9    18     1     3
4    11    22     1     4
5    13    26     1     5

In [133]:
np.nan

nan

In [134]:
DataFrame([1,2,3,np.nan])

    0
0   1
1   2
2   3
3 NaN

In [138]:
# Very useful
dataframe3=DataFrame([1,2,3,np.nan])
dataframe3.dropna()

   0
0  1
1  2
2  3

In [136]:
# Transpose
dataframe3.T

   0  1  2   3
0  1  2  3 NaN

In [140]:
dataframe3.T.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [141]:
dataframe3

    0
0   1
1   2
2   3
3 NaN

In [148]:
dataframe3[0][2]=4
dataframe3

    0
0   1
1   2
2   4
3 NaN

In [149]:
indice=dataframe3.index
indice

Int64Index([0, 1, 2, 3], dtype='int64')

In [151]:
# error
indice[3]=8

TypeError: Indexes does not support mutable operations

In [152]:
2 in indice

True

In [153]:
20 in indice

False

In [154]:
2 in dataframe1.index

True

In [155]:
2 in dataframe1.values

True

In [157]:
"col1" in dataframe1.columns

True

In [159]:
dataframe1+dataframe1

   col1  col2  col3  col4
0     6    12     2     0
1    10    20     2     2
2    14    28     2     4
3    18    36     2     6
4    22    44     2     8
5    26    52     2    10

In [160]:
dataframe1.columns=["Columna1","Columna2","Columna3","Columna4"]
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [161]:
# Important to match number of columns
dataframe1.columns=["Columna1","Columna2","Columna3","Columna4","Columna5"]

ValueError: Length mismatch: Expected axis has 4 elements, new values have 5 elements

In [162]:
dataframe1.reindex(columns=["Columna1","Columna2","Columna3","Columna4","Columna5"])

   Columna1  Columna2  Columna3  Columna4  Columna5
0         3         6         1         0       NaN
1         5        10         1         1       NaN
2         7        14         1         2       NaN
3         9        18         1         3       NaN
4        11        22         1         4       NaN
5        13        26         1         5       NaN

In [165]:
dataframe1.reindex(columns=["Column6"])

   Column6
0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN

In [166]:
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [181]:
pd.concat([dataframe1,dataframe1])

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [183]:
dataframeconvacios=dataframe1.reindex(columns=["Columna1","c2","c3"])
dataframeconvacios

   Columna1  c2  c3
0         3 NaN NaN
1         5 NaN NaN
2         7 NaN NaN
3         9 NaN NaN
4        11 NaN NaN
5        13 NaN NaN

In [184]:
dataframeconvacios.dropna()

Empty DataFrame
Columns: [Columna1, c2, c3]
Index: []

In [186]:
dataframeconvacios.fillna(1)

   Columna1  c2  c3
0         3   1   1
1         5   1   1
2         7   1   1
3         9   1   1
4        11   1   1
5        13   1   1

In [192]:
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [188]:
# Access to data columns/file
dataframe1["Columna2"][1]

10

In [190]:
dataframe1.ix[1]

Columna1     5
Columna2    10
Columna3     1
Columna4     1
Name: 1, dtype: int64

In [191]:
dataframe1.ix[1]["Columna2"]

10

In [196]:
serie1 = dataframe1["Columna2"]
serie1

0     6
1    10
2    14
3    18
4    22
5    26
Name: Columna2, dtype: int64

In [195]:
serie1>10

0    False
1    False
2     True
3     True
4     True
5     True
Name: Columna2, dtype: bool

In [197]:
dataframe1[dataframe1["Columna2"]>10]

   Columna1  Columna2  Columna3  Columna4
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [200]:
dataframe1[(dataframe1["Columna2"]>10) & (dataframe1["Columna4"]>3)]

   Columna1  Columna2  Columna3  Columna4
4        11        22         1         4
5        13        26         1         5

In [201]:
dataframe1[(dataf#funtirame1["Columna2"]>10) & (dataframe1["Columna4"]>3)]["Columna1"]

4    11
5    13
Name: Columna1, dtype: int64

### Functions

In [202]:
def suma(val):
    return val+1

In [203]:
suma(3)

4

In [205]:
dataframe1.applymap(suma)

   Columna1  Columna2  Columna3  Columna4
0         4         7         2         1
1         6        11         2         2
2         8        15         2         3
3        10        19         2         4
4        12        23         2         5
5        14        27         2         6

In [206]:
# Only one line using function 'lambda'
# applying to all elements within dataframe
dataframe1.applymap(lambda element : 2*element+1)

   Columna1  Columna2  Columna3  Columna4
0         7        13         3         1
1        11        21         3         3
2        15        29         3         5
3        19        37         3         7
4        23        45         3         9
5        27        53         3        11

In [210]:
# first contact with Mapreduce (reducing dimentions)
# by columns
dataframe1.apply(lambda serie: serie.max())

Columna1    13
Columna2    26
Columna3     1
Columna4     5
dtype: int64

In [211]:
#By rows
dataframe1.apply(lambda serie: serie.max(),axis=1)

0     6
1    10
2    14
3    18
4    22
5    26
dtype: int64

In [212]:
dataframe1.apply(lambda serie: Series([serie.min(),serie.max()]))

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1        13        26         1         5

In [215]:
dataframe1.apply(lambda serie: Series([serie[0],serie[1]]))

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1

In [216]:
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [217]:
# functions that applies to series instead of elements or variables
def minserie(serie):
    return serie.min()
minserie(dataframe1["Columna2"])

6

In [218]:
# Apply funtions to ALL columnsdataframe1.apply(minserie)
dataframe1.apply(minserie)

Columna1    3
Columna2    6
Columna3    1
Columna4    0
dtype: int64

In [221]:
def ask(row):
    return row["capacity"]*row["km"]

In [223]:
paxdata = DataFrame({'fligth':["FL01","FL02"],'capacity':[70,100],'km':[10000,1000]})

In [225]:
paxdata.apply(ask,axis=1)

0    700000
1    100000
dtype: int64

In [226]:
paxdata["ask"]=paxdata.apply(ask,axis=1)
paxdata

   capacity fligth     km     ask
0        70   FL01  10000  700000
1       100   FL02   1000  100000

### Loading and saving data

In [227]:
import pandas as pd
from pandas import Series,DataFrame

In [229]:
!ls -l /home/dsc/Data/opentraveldata/

total 8028
-rw-r--r--. 1 dsc dsc   18612 Nov  8 14:10 optd_aircraft.csv
-rw-r--r--. 1 dsc dsc  107306 Nov  8 14:10 optd_airlines.csv
-rw-r--r--. 1 dsc dsc 8080005 Nov  8 14:10 optd_por_public.csv
-rw-rw-r--. 1 dsc dsc    5816 Nov  9 12:53 ref_airline_nb_of_flights.csv

In [230]:
aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv")

In [232]:
aircraftdf.ix(1)

In [233]:
aircraftdf.head()

  iata_code^manufacturer^model^iata_group^iata_category^icao_code^nb_engines^aircraft_type
0                     100^Fokker^100^100^2J^F100^2^J
1                    141^BAe^146-100^146^4J^B461^4^J
2  142^BAe^BAE Systems 146-200 Passenger^146^4J^B...
3                    143^BAe^146-300^146^4J^B463^4^J
4                                   146^BAe^146^^^^^

In [234]:
aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv",sep="^")

In [235]:
aircraftdf.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [236]:
len(aircraftdf)

457

In [237]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [239]:
aircraftdf.columns

Index([u'iata_code', u'manufacturer', u'model', u'iata_group',
       u'iata_category', u'icao_code', u'nb_engines', u'aircraft_type'],
      dtype='object')

In [240]:
aircraftdf.sort("manufacturer").head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
173,AT4,ATR,ATR 42-300 / 320,ATR,2T,AT43,2,T
174,AT5,ATR,ATR 42-500,ATR,2T,AT45,2,T
175,AT7,ATR,ATR 72,ATR,2T,AT72,2,T
176,ATD,ATR,ATR 42-400,ATR,2T,AT44,2,T
177,ATF,ATR,ATR 72 Freighter,ATF,2T,AT72,2,T

In [242]:
aircraftdf.sort("nb_engines",ascending=False).head(10)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
145,A5F,Antonov,An-225,A5F,6J,A225,6,J
89,742,Boeing,747-200,747,4J,B742,4,J
106,74V,Boeing,747SR Freighter,74F,4J,B74R,4,J
94,74C,Boeing,747-200 Combi,74M,4J,B742,4,J
368,IL8,Ilyushin,IL-18,IL8,4T,IL18,4,T
369,IL9,Ilyushin,IL-96,IL9,4J,IL96,4,J
370,ILW,Ilyushin,IL-86,ILW,4J,IL86,4,J
302,DH7,De Havilland Canada,DHC-7 Dash 7,DH7,4T,DHC7,4,T
274,D8X,Douglas,DC-8-61 / 62 / 63 Freighter,D8F,4J,DC86,4,J
275,D8Y,Douglas,DC-8-71 / 72 / 73 Freighter,D8F,4J,DC87,4,J

In [243]:
dataframe1.rank()

   Columna1  Columna2  Columna3  Columna4
0         1         1       3.5         1
1         2         2       3.5         2
2         3         3       3.5         3
3         4         4       3.5         4
4         5         5       3.5         5
5         6         6       3.5         6

In [246]:
dataframe1.rank(method='first')

   Columna1  Columna2  Columna3  Columna4
0         1         1         1         1
1         2         2         2         2
2         3         3         3         3
3         4         4         4         4
4         5         5         5         5
5         6         6         6         6

In [247]:
dataframe1.rank(pct=True)

   Columna1  Columna2  Columna3  Columna4
0  0.166667  0.166667  0.583333  0.166667
1  0.333333  0.333333  0.583333  0.333333
2  0.500000  0.500000  0.583333  0.500000
3  0.666667  0.666667  0.583333  0.666667
4  0.833333  0.833333  0.583333  0.833333
5  1.000000  1.000000  0.583333  1.000000

In [248]:
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         3         6         1         0
1         5        10         1         1
2         7        14         1         2
3         9        18         1         3
4        11        22         1         4
5        13        26         1         5

In [250]:
aircraftdf.sum()

nb_engines    826
dtype: float64

In [251]:
aircraftdf.to_csv("salida.csv")
!ls -l

total 144
-rw-rw-r--. 1 dsc dsc 115489 Dec  8 08:01 pandas_getting_started.ipynb
-rw-rw-r--. 1 dsc dsc  21017 Dec  8 08:03 salida.csv
-rw-rw-r--. 1 dsc dsc   3060 Nov 28 14:15 Untitled.ipynb

In [252]:
aircraftdf.to_excel("salida.xls")

ImportError: No module named xlwt

In [254]:
# execute previously library install: "sudo pip install xlwt"
aircraftdf.to_excel("salida.xls")
!ls -l

total 228
-rw-rw-r--. 1 dsc dsc 119571 Dec  8 08:05 pandas_getting_started.ipynb
-rw-rw-r--. 1 dsc dsc  21017 Dec  8 08:03 salida.csv
-rw-rw-r--. 1 dsc dsc  79872 Dec  8 08:07 salida.xls
-rw-rw-r--. 1 dsc dsc   3060 Nov 28 14:15 Untitled.ipynb

In [255]:
# converting to python dictionary
minidf = aircraftdf.head()
minidf.to_dict()

{'aircraft_type': {0: 'J', 1: 'J', 2: 'J', 3: 'J', 4: nan},
 'iata_category': {0: '2J', 1: '4J', 2: '4J', 3: '4J', 4: nan},
 'iata_code': {0: '100', 1: '141', 2: '142', 3: '143', 4: '146'},
 'iata_group': {0: '100', 1: '146', 2: '146', 3: '146', 4: nan},
 'icao_code': {0: 'F100', 1: 'B461', 2: 'B462', 3: 'B463', 4: nan},
 'manufacturer': {0: 'Fokker', 1: 'BAe', 2: 'BAe', 3: 'BAe', 4: 'BAe'},
 'model': {0: '100',
  1: '146-100',
  2: 'BAE Systems 146-200 Passenger',
  3: '146-300',
  4: '146'},
 'nb_engines': {0: 2.0, 1: 4.0, 2: 4.0, 3: 4.0, 4: nan}}

In [256]:
# Option useful to use in web pages (JSON)
minidf.to_dict(orient="records")

[{'aircraft_type': 'J',
  'iata_category': '2J',
  'iata_code': '100',
  'iata_group': '100',
  'icao_code': 'F100',
  'manufacturer': 'Fokker',
  'model': '100',
  'nb_engines': 2.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '141',
  'iata_group': '146',
  'icao_code': 'B461',
  'manufacturer': 'BAe',
  'model': '146-100',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '142',
  'iata_group': '146',
  'icao_code': 'B462',
  'manufacturer': 'BAe',
  'model': 'BAE Systems 146-200 Passenger',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '143',
  'iata_group': '146',
  'icao_code': 'B463',
  'manufacturer': 'BAe',
  'model': '146-300',
  'nb_engines': 4.0},
 {'aircraft_type': nan,
  'iata_category': nan,
  'iata_code': '146',
  'iata_group': nan,
  'icao_code': nan,
  'manufacturer': 'BAe',
  'model': '146',
  'nb_engines': nan}]

In [258]:
# Managing files
fileoutput = open("fichero.json","w")
fileoutput.write(minidf.to_json(orient="records"))
fileoutput.close()
!ls -l

total 236
-rw-rw-r--. 1 dsc dsc    792 Dec  8 08:19 fichero.json
-rw-rw-r--. 1 dsc dsc 123323 Dec  8 08:19 pandas_getting_started.ipynb
-rw-rw-r--. 1 dsc dsc  21017 Dec  8 08:03 salida.csv
-rw-rw-r--. 1 dsc dsc  79872 Dec  8 08:07 salida.xls
-rw-rw-r--. 1 dsc dsc   3060 Nov 28 14:15 Untitled.ipynb

In [262]:
aircraftdf2 = pd.read_excel("salida.xls")
aircraftdf2.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

### Fake Data

In [280]:
fakedf = DataFrame({"col1":range(0,1000)})
fakedf.head()

   col1
0     0
1     1
2     2
3     3
4     4

In [281]:
fakedf = DataFrame(np.random.randn(1000,1))
fakedf = 100*fakedf.head()
fakedf

            0
0 -107.560820
1 -141.038178
2  -46.015080
3   19.094021
4  117.660470

In [282]:
fakedf.columns=['Population']
fakedf

   Population
0 -107.560820
1 -141.038178
2  -46.015080
3   19.094021
4  117.660470

In [283]:
fakedf["Population"]=fakedf.apply(lambda row: int(abs(100*row[0])),axis=1)
fakedf

   Population
0       10756
1       14103
2        4601
3        1909
4       11766

In [284]:
# Be careful if you run your code more times
fakedf["Population"]=fakedf.apply(lambda row: int(abs(100*row[0])),axis=1)
fakedf

   Population
0     1075600
1     1410300
2      460100
3      190900
4     1176600